<a href="https://colab.research.google.com/github/tomashphill/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-08-05 21:46:15--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.32.190
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.32.190|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  16.4MB/s    in 13s

2020-08-05 21:46:29 (14.6 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [ ]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [ ]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01/instacart_2017_05_01/instacart_2017_05_01/instacart_2017_05_01

In [ ]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [ ]:
##### YOUR CODE HERE #####
import pandas as pd

In [ ]:
products = pd.read_csv('products.csv')
products.head()

# Need:
# product_id
# product_name

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [ ]:
# concat dataframes by rows
order_products__train = pd.read_csv('order_products__train.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')

order_products = pd.concat([order_products__train, order_products__prior])
order_products.head(10)

# Need: 
# order_id
# product_id

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1
5         1       13176                  6          0
6         1       47209                  7          0
7         1       22035                  8          1
8        36       39612                  1          0
9        36       19660                  2          1

In [ ]:
# Get top 10 orders
top10 = order_products['product_id'].value_counts().index.values[:10]
top10

array([24852, 13176, 21137, 21903, 47209, 47766, 47626, 16797, 26209,
       27845])

In [ ]:
# Clean up datafram to contain only the top 10 orders
condition = order_products['product_id'].isin(top10)
order_products_top10 = order_products[condition]

# Merge order_products with products
order_products_top10 = pd.merge(order_products_top10, products, on="product_id")
order_products_top10 = order_products_top10.drop(['aisle_id', 'reordered', 'department_id', 'add_to_cart_order'], axis=1)

In [ ]:
order_products_top10

         order_id  product_id            product_name
0               1       13176  Bag of Organic Bananas
1              98       13176  Bag of Organic Bananas
2             170       13176  Bag of Organic Bananas
3            1077       13176  Bag of Organic Bananas
4            1325       13176  Bag of Organic Bananas
...           ...         ...                     ...
2418309   3421007       47766         Organic Avocado
2418310   3421016       47766         Organic Avocado
2418311   3421024       47766         Organic Avocado
2418312   3421029       47766         Organic Avocado
2418313   3421047       47766         Organic Avocado

[2418314 rows x 3 columns]

In [ ]:
# The amount of top10 orders:
order_products_top10['product_name'].value_counts()

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [ ]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [ ]:
# table2 -> tidy
table2 = table2.reset_index()
table2
#tidy = table2.melt(id_vars=table2[])

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [ ]:
table2 = table1.reset_index()
table2

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [ ]:
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [ ]:
# unique identifier: treatments
# grab values from under the names
tidy = table2.melt(id_vars='index', value_vars=table2.columns[1:])

In [ ]:
tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [ ]:
# reorder columns
tidy1 = tidy[['variable', 'index', 'value']]

# rename columns
tidy1 = tidy1.rename(columns={
    'index': 'trt', 
    'variable': 'name', 
    'value': 'result'
})

# sort by name and treatment
tidy1 = tidy1.sort_values(['trt', 'name'])
tidy1

           name         trt  result
2      Jane Doe  treatmenta    16.0
0    John Smith  treatmenta     NaN
4  Mary Johnson  treatmenta     3.0
3      Jane Doe  treatmentb    11.0
1    John Smith  treatmentb     2.0
5  Mary Johnson  treatmentb     1.0

In [ ]:
# tidy -> table2
table2 = tidy1.pivot_table(index='trt', columns='name', values='result')
table2

name        Jane Doe  John Smith  Mary Johnson
trt
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [ ]:
import seaborn as sns
flights = sns.load_dataset('flights')
flights

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [ ]:
# Create a pivot table showing the number of passengers by month and year. 
# Use year for the index and month for the columns. 
# You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

flights_pivot = flights.pivot_table(values='passengers' ,index='year', columns='month')
flights_pivot

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

### I realized for this section I summed up the total amount of each product purchased from the time frame of 12:00 - 24:00, instead of just looking at the last 25 ordered products.

In [ ]:
##### YOUR CODE HERE #####
# filter for orders purchased after 12
orders = pd.read_csv('orders.csv')
orders_after_12 = orders[orders['order_hour_of_day'] >= 12]
orders_after_12.head()

    order_id  user_id  ... order_hour_of_day  days_since_prior_order
2     473747        1  ...                12                    21.0
4     431534        1  ...                15                    28.0
7    3108588        1  ...                14                    14.0
8    2295261        1  ...                16                     0.0
17   3194192        2  ...                12                    14.0

[5 rows x 7 columns]

In [ ]:
# filter for orders made after 12
evening_order_products = order_products[order_products['order_id'].isin(orders_after_12['order_id'])]
evening_order_products

          order_id  product_id  add_to_cart_order  reordered
8               36       39612                  1          0
9               36       19660                  2          1
10              36       49235                  3          0
11              36       43086                  4          1
12              36       46620                  5          1
...            ...         ...                ...        ...
32434474   3421082       16797                  3          0
32434475   3421082       43352                  4          1
32434476   3421082       32700                  5          1
32434477   3421082       12023                  6          0
32434478   3421082       47941                  7          0

[21899206 rows x 4 columns]

In [ ]:
# find top 25 products by their id
top25_products_id = evening_order_products['product_id'].value_counts().index.values[:25]
top25_products_id

array([24852, 13176, 21137, 21903, 47209, 47766, 47626, 26209, 16797,
       27845, 27966, 22935, 24964, 45007, 39275, 49683,  5876, 40706,
       28204, 30391,  8277,  4920, 45066, 42265,  4605])

In [ ]:
top25_products = products[products['product_id'].isin(top25_products_id)]
top25_products

       product_id              product_name  aisle_id  department_id
4604         4605             Yellow Onions        83              4
4919         4920       Seedless Red Grapes       123              4
5875         5876             Organic Lemon        24              4
8276         8277  Apple Honeycrisp Organic        24              4
13175       13176    Bag of Organic Bananas        24              4
16796       16797              Strawberries        24              4
21136       21137      Organic Strawberries        24              4
21902       21903      Organic Baby Spinach       123              4
22934       22935      Organic Yellow Onion        83              4
24851       24852                    Banana        24              4
24963       24964            Organic Garlic        83              4
26208       26209                     Limes        24              4
27844       27845        Organic Whole Milk        84             16
27965       27966       Organic Raspberries       123              4
28203       28204        Organic Fuji Apple        24              4
30390       30391          Organic Cucumber        83              4
39274       39275       Organic Blueberries       123              4
40705       40706    Organic Grape Tomatoes       123              4
42264       42265      Organic Baby Carrots       123              4
45006       45007          Organic Zucchini        83              4
45065       45066          Honeycrisp Apple        24              4
47208       47209      Organic Hass Avocado        24              4
47625       47626               Large Lemon        24              4
47765       47766           Organic Avocado        24              4
49682       49683            Cucumber Kirby        83              4

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [ ]:
##### YOUR CODE HERE #####